smartcartech/SmartCarTech_Web/ate-automation/src/ESP32_3USB_3DLC_OTA_v03.00.05.cpp
  if (WiFi.status() != WL_CONNECTED) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("No WiFi Connection!");
    delay(1500);
    return;
  }


  WiFiClientSecure client;
  client.setInsecure(); // Bỏ qua kiểm tra chứng chỉ SSL

  HTTPClient http;
  http.begin(client, version_url);

  int httpCode = http.GET();

  if (httpCode != HTTP_CODE_OK) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("Server Error: ");
    lcd.print(httpCode);
    delay(1500);
    http.end();
    return;
  }

  String payload = http.getString();

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, payload);

  if (error) {
    lcd.clear();
    lcd.setCursor(0, 1); 
    lcd.print("JSON Error!");
    delay(1500);
    http.end();
    return;
  }

  // Đọc version từ JSON:
  // {
  //   "version": "03.00.01",
  //   "version_code": 30001,
  //   "bin_file": "ESP32_3USB_3DLC_OTA_v03.00.01.bin"
  // }
  const char* new_version = doc["version"] | "";
  uint32_t new_version_code = doc["version_code"] | 0;
  const char* bin_file_name = doc["bin_file"] | "";

  // Kiểm tra JSON có đủ dữ liệu bắt buộc hay không
  if (new_version_code == 0 || strlen(new_version) == 0 || strlen(bin_file_name) == 0) {
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("Invalid version.json");
    lcd.setCursor(0, 1); 
    lcd.print("Missing data!");
    delay(2000);
    http.end();
    return;
  }

  // Debug ra USB Serial để dễ kiểm tra khi cần
  USBSerial.print("Current Version: ");
  USBSerial.println(CURRENT_VERSION);
  USBSerial.print("Current Version Code: ");
  USBSerial.println(CURRENT_VERSION_CODE);
  USBSerial.print("Server Version: ");
  USBSerial.println(new_version);
  USBSerial.print("Server Version Code: ");
  USBSerial.println(new_version_code);

  // Chỉ OTA khi VERSION_CODE trên server lớn hơn VERSION_CODE hiện tại
  if (new_version_code > CURRENT_VERSION_CODE) {
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("New Version Found!");

    lcd.setCursor(0, 1); 
    lcd.print("Current V: "); 
    lcd.print(CURRENT_VERSION);

    lcd.setCursor(0, 2); 
    lcd.print("New V:     "); 
    lcd.print(new_version);

    lcd.setCursor(0, 3); 
    lcd.print("Downloading FW...");

    String full_bin_url = String(base_bin_url) + String(bin_file_name);

    // Kết thúc HTTP request version.json trước khi download file BIN
    http.end();

    t_httpUpdate_return ret = httpUpdate.update(client, full_bin_url);

    switch (ret) {
      case HTTP_UPDATE_FAILED:
        lcd.clear();
        lcd.setCursor(0, 0); 
        lcd.print("Update Failed!");

        lcd.setCursor(0, 1); 
        lcd.print("Error: ");
        lcd.print(httpUpdate.getLastError());

        lcd.setCursor(0, 2); 
        lcd.print(httpUpdate.getLastErrorString());
        delay(3000);
        break;

      case HTTP_UPDATE_NO_UPDATES:
        lcd.clear();
        lcd.setCursor(0, 1); 
        lcd.print("No Update Needed");
        delay(1500);
        break;

      case HTTP_UPDATE_OK:
        // ESP32 HTTPUpdate thường tự restart sau khi update thành công.
        // Đoạn dưới vẫn giữ để hiển thị trạng thái nếu thư viện trả về.
        lcd.clear();
        lcd.setCursor(0, 1); 
        lcd.print("Update Success!");
        lcd.setCursor(0, 2); 
        lcd.print("Rebooting...");
        delay(1000);
        ESP.restart();
        break;
    }
  } 
  else {
    // VERSION_CODE bằng hoặc nhỏ hơn firmware hiện tại -> KHÔNG download
    lcd.clear();
    lcd.setCursor(0, 0); 
    lcd.print("Already Up To Date!");

    lcd.setCursor(0, 1); 
    lcd.print("Current V: "); 
    lcd.print(CURRENT_VERSION);

    lcd.setCursor(0, 2); 
    lcd.print("Server V:  "); 
    lcd.print(new_version);

    delay(3000);
    http.end();
  }
}


void trigger11Keys() {
  for (int p = 0; p < 11; p++) {
    mcp.digitalWrite(p, LOW);  delay(200);                
    mcp.digitalWrite(p, HIGH); delay(200);                
  }
}

// ==========================================
// MÁY TRẠNG THÁI (HỖ TRỢ CẢ 2 CHẾ ĐỘ AUTO VÀ PC)
// ==========================================
void handleRunSequence() {
  unsigned long currentMillis = millis();
  
  switch(runStep) {
    case 2: 
      if (currentMillis - previousMillis >= delayDisconnect * 1000UL) { runStep = 3; }
      break;
      
    case 3: 
      usbServos[currentPair].attach(USB_SERVO_PINS[currentPair]);  
      usbServos[currentPair].write(usbAngleB[currentPair]);
      
      previousMillis = currentMillis; runStep = 4;
      if(isRunManually) { lcd.setCursor(0, 2); lcd.print("USB Connected..."); }
      break;
      
    case 4: 
      if (currentMillis - previousMillis >= 1000UL) {
        detachServoSafe(currentPair); 
        previousMillis = currentMillis; runStep = 5;
      }
      break;
      
    case 5: 
      if (currentMillis - previousMillis >= 1000UL) {
        mcp.digitalWrite(DLC_RELAY_PINS[currentPair], LOW); 
        runStep = 6; 
        previousMillis = currentMillis; 
        if (isRunManually) { lcd.setCursor(0, 2); lcd.print("DLC Connected..."); } 
        else { lcd.setCursor(0, 2); lcd.print("Waiting PC Command.."); }
      }
      break;
      
    case 6: 
      if (isRunManually) {
          unsigned long waitTime = 0;
          if (delayConnect * 1000UL > 7400UL) { waitTime = delayConnect * 1000UL - 7400UL; }
          
          if (currentMillis - previousMillis >= waitTime) {
              lcd.setCursor(0, 2); lcd.print("Testing 11 Keys...  ");
              trigger11Keys(); 
              
              previousMillis = millis(); runStep = 61; 
          }
      }
      break;

    case 61: 
      if (isRunManually) {
          if (currentMillis - previousMillis >= 3000UL) {
              runStep = 7;
              lcd.setCursor(0, 2); lcd.print("Changing Tool...");
          }
      }
      break;

    case 7: 
      mcp.digitalWrite(DLC_RELAY_PINS[currentPair], HIGH); 
      previousMillis = currentMillis; runStep = 8;
      break;

    case 8:
      if (currentMillis - previousMillis >= 500UL) {
        usbServos[currentPair].attach(USB_SERVO_PINS[currentPair]);  
        usbServos[currentPair].write(usbAngleA[currentPair]); 
        previousMillis = currentMillis; runStep = 9;
      }
      break;

    case 9:
      if (currentMillis - previousMillis >= 1000UL) {
        detachServoSafe(currentPair); 
        currentPair++;
        if (currentPair > 2) currentPair = 0; 
        lcd.setCursor(6, 1); lcd.print(currentPair + 1); 
        
        previousMillis = currentMillis; 
        runStep = 2; 
        lcd.setCursor(0, 2); lcd.print("Change Complete..."); 
      }
      break;
  }
}

